tutorials/combustion/rhoReactingFoam/groundAbsorption/0.orig/CH4
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      CH4;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "(outlet|sides)"
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    base
    {
        type                speciesSorption;
        equilibriumModel    Langmuir;
        kinematicModel      PseudoFirstOrder;
        kabs                10;     // [1/sec]
        kl                  0.01;   //[1/mol]
        max                 0.1;    // [mol/Kg]
        thickness           uniform 1e-3;
        rhoS                2000;
        value               $internalField;
    }

    inlet
    {
        type            fixedValue;
        value           uniform 1.0;
    }
}


// ************************************************************************* //
